<?php

// +----------------------------------------------------------------------
// | HopePHP
// +----------------------------------------------------------------------
// | Copyright (c) 2017 http://www.wispx.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: WispX <i@wispx.cn>
// +----------------------------------------------------------------------

// [ 数据库配置 ]

return [
    // 数据库类型
    'driver'    => 'mysql',
    // 数据库连接地址
    'host'      => 'localhost',
    // 数据库名
    'database'  => 'test',
    // 数据库用户名
    'username'  => 'root',
    // 数据库密码
    'password'  => 'root',
    // 数据库编码
    'charset'   => 'utf8',
    // 数据库字段编码
    'collation' => 'utf8_general_ci',
    // 数据库表前缀
    'prefix'    => ''

];